[
    {
        "first": "William",
        "last": "McGonagle",
        "email": "mcgonaglew@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/19496353?v=4",
        "biography": "William McGonagle is a Co-Founder, President, and Board Member of the FPA. Born on September 8th, 2004, he currently resides in Bridgeport, Connecticut near the headquarters of the FPA. After seeing how income disparity contributes to a shortage of education, he decided that there needed to be more opportunities for learning. He had discussed the problem with a friend, Neil Chaudhari, and within a few weeks, the two were working on building the FPA.",
        "works": "As the current CEO of the FPA, William mostly watches over general management of all projects while also trying to expand to new areas. Many of the projects created by William have been described as 'risky' and 'bold' by none-other than Neil Chaudhari himself.",
        "work": [
            0,
            1,
            2,
            3
        ]
    },
    {
        "first": "Neil",
        "last": "Chaudhari",
        "email": "chaudharin@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/30356902?v=4",
        "biography": "Neil Chaudhari is a Co-Founder, CEO, and Board Member of the FPA.  After seeing how income disparity contributes to a shortage of education, he decided that there needed to be more opportunities for learning. He had discussed the problem with a friend, William McGonagle, and within a few weeks, the two were working on building the FPA. Neil has a background in Data Science and Artificial Intelligence, and is conducting research on it at the moment.",
        "works": "As the current CEO of the FPA, Neil mostly watches over the management of all of the FPA’s projects, with a focus on FPA Charter and Learning.",
        "work": [
            0,
            1,
            4,
            6
        ]
    },
    {
        "first": "Jamie",
        "last": "Davis",
        "email": "davisj@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96844187?v=4",
        "biography": "Jamie Davis is an FPA volunteer and original member who has been working with the Charter program since its inception. He and Tristan Ebrahimi have worked to build the charter program through community building with schools and organizations that share similar missions with the FPA. He has helped the FPA achieve its mission by conducting outreach, writing educational materials, and personally teaching kids in libraries and schools around Fairfield County.",
        "works": "Jamie is currently hard at work building up the FPA’s charter program by building relationships with schools around the world.",
        "work": [
            0,
            1
        ]
    },
    {
        "first": "Will",
        "last": "Drapkin",
        "email": "willdrapkin@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/111072674?v=4",
        "biography": "Will Drapkin is the CFO of the FPA from St Luke’s in CT. His mission is to bring coding outreach to underserved communities.",
        "works": "Currently Will is working on outreach and funding",
        "work": []
    },
    {
        "first": "Aaron",
        "last": "Hopper",
        "email": "hoppera@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96844187?v=4",
        "biography": "Aaron Hopper is the Head of International Education who joined to teach students abroad programming. He believes it is very important that those who want to learn to code, but may not have the resources, be given an opportunity to learn. Aaron knows both Python and Java and has experience working with Artificial Intelligence",
        "works": "Aaron Hopper is currently working on our Introduction to Python and AI course, and teaching it to students in India.",
        "work": [
            0,
            1
        ]
    },
    {
        "first": "Lachlan",
        "last": "McCracken",
        "email": "mccrackenm@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96844187?v=4",
        "biography": "Lachlan McCracken is the Head of Charter Outreach for the FPA. She is working to partner the FPA with community organizations that would not otherwise offer coding programs.",
        "works": "As the head of the FPA Charter Outreach Program, Lachlan is not only involved in outreach but also in charter events.",
        "work": [
            0,
            1
        ]
    },
    {
        "first": "Sankalp",
        "last": "Ojha",
        "email": "sankalpojha@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/139890728?v=4",
        "biography": "Sankalp Ojha is a FPA member from St. Luke’s School. He is the founder and chair of the St. Luke’s charter. He decided to join the cause after seeing how income disparity contributes to a shortage of education. His mission is to bring coding to underserved communities",
        "works": "Sankalp is currently working on charter program at the St Luke's school as well as educating students in India",
        "work": []
    },
    {
        "first": "Uri",
        "last": "Moon-Rosha",
        "email": "moonroshau@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96844187?v=4",
        "biography": "",
        "works": "",
        "work": []
    },
    {
        "first": "Tristan",
        "last": "Ebrahimi",
        "email": "ebrahimit@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96844187?v=4",
        "biography": "Tristan Ebrahimi is an FPA volunteer closely connected to the Charter program as he has been working on it since its beginning. He and Jamie Davis have worked hard to craft it into the community-driven, colaborative, and supportive program that it is today.",
        "works": "As one of the regional managers for the FPA Charter program, Tristan is mostly involved in Charter Events and Charter Outreach programs.",
        "work": [
            0,
            1
        ]
    },
    {
        "first": "Hanzi",
        "last": "Li",
        "email": "lih@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96609857?v=4",
        "biography": "Hanzi Li is an FPA volunteer who was born on February 17, 2004 and presently resides in Montréal, Québec, Canada.",
        "works": "As the main manager of the FPA Vault, Hanzi oversees the standardization of many FPA ideas and also approves third-party submissions.",
        "work": [
            5
        ]
    },
    {
        "first": "Prashnta",
        "last": "Pandey",
        "email": "pandeyp@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/83771967?v=4",
        "biography": "Prashnta Pandey is an FPA volunteer currently living in Kathmandu, Nepal. He is currently working as the lead developer behind the FPA Learning Platform, a tool that will help revolutionize access to learning resources.",
        "works": "As the lead developer behind the FPA Learning Platform, Prashnta oversees all aspects of developing a solid foundation in which future learning systems will be built.",
        "work": [
            7
        ]
    },
    {
        "first": "Alain",
        "last": "Prestige",
        "email": "prestigea@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/11784116?v=4",
        "biography": "Alain Prestige is an FPA volunteer currently living in Liège, Belgium. He currently is the lead developer on the FPA License List, building out a registry of all the open-source, source-available, and commercial licenses the digital world has.",
        "works": "As the lead on the License List project, Alain has been steadily building an open-access API along with a standard (available on The Vault). Together, these will revolutionize the ways that licenses are queried and used.",
        "work": [
            4
        ]
    },
    {
        "first": "Siddhi",
        "last": "Singh",
        "email": "singhs@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96844187?v=4",
        "biography": "",
        "works": "As one of the editors of the FPA Learning Videos, Siddhi has deeply informed the style of the FPA Learning Content. With her important input and view on the editing process, Siddhi is a core member of the editing team.",
        "work": [
            6
        ]
    },
    {
        "first": "Shubh",
        "last": "Varshney",
        "email": "varshneys@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96844187?v=4",
        "biography": "",
        "works": "As an editor of the FPA Learning Videos, Shubh is an integral member of the production process.",
        "work": [
            6
        ]
    }
]