[
    {
        "first": "William",
        "last": "McGonagle",
        "email": "mcgonaglew@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/19496353?v=4",
        "biography": "William McGonagle is one of the co-founders of the FPA. Born on September 8th, 2004, he currently resides in Bridgeport, Connecticut near the headquarters of the FPA. After seeing how income disparity contributes to a shortage of education, he decided that there needed to be more opportunities for learning. He had discussed the problem with a friend, Neil Chaudhari, and within a few weeks, the two were working on building the FPA.",
        "works": "As the current CEO of the FPA, William mostly watches over general management of all projects while also trying to expand to new areas. Many of the projects created by William have been described as 'risky' and 'bold' by none-other than Neil Chaudhari himself.",
        "work": [
            0,
            1,
            2,
            3
        ]
    },
    {
        "first": "Neil",
        "last": "Chaudhari",
        "email": "chaudharin@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/30356902?v=4",
        "biography": "Neil Chaudhari is one of the co-founders of the FPA. Born on September 23rd, 2006, he currently resides in Darien, CT. After discussing how income disparity in our county contributes to a shortage of education, he and William McGonagle began to work on the FPA.",
        "works": "As the current President of the FPA, Neil mostly watches over the management of all of the FPA’s projects, with a focus on FPA Charter and Learning.",
        "work": [
            0,
            1,
            4
        ]
    },
    {
        "first": "Charles",
        "last": "Ferragu",
        "email": "ferraguc@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96844187?v=4",
        "biography": "Charles Ferragu is an FPA board member who was born on November 13, 2006 and presently resides in Southport, Connecticut. When he learned that his dear friends William and Neil were launching a non-profit to help address the education shortfall, he decided to join and assist expand the organization with the hopes of impacting many lives.",
        "works": "Works mainly with the charter-outreach and charter-events.",
        "work": [
            0,
            1
        ]
    },
    {
        "first": "Jamie",
        "last": "Davis",
        "email": "davisj@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96844187?v=4",
        "biography": "Jamie Davis is an FPA volunteer who has been working with the Charter program since its inception. He and Tristan Ibrahimi have worked to build the charter program through community building with schools and organizations that share similar missions with the FPA.",
        "works": "As one of the regional managers for the FPA Charter program, Jamie is mostly involved in Charter Events and Charter Outreach programs.",
        "work": [
            0,
            1
        ]
    },
    {
        "first": "Tristan",
        "last": "Ebrahimi",
        "email": "ebrahimit@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96844187?v=4",
        "biography": "Tristan Ibrahimi is an FPA volunteer closely connected to the Charter program as he has been working on it since its beginning. He and Jamie Davis have worked hard to craft it into the community-driven, colaborative, and supportive program that it is today.",
        "works": "As one of the regional managers for the FPA Charter program, Tristan is mostly involved in Charter Events and Charter Outreach programs.",
        "work": [
            0,
            1
        ]
    },
    {
        "first": "Hanzi",
        "last": "Li",
        "email": "lih@fairfieldprogramming.org",
        "photo": "https://avatars.githubusercontent.com/u/96609857?v=4",
        "biography": "Hanzi Li is an FPA volunteer who was born on February 17, 2004 and presently resides in Montréal, Québec, Canada.",
        "works": "Manages the Vault project",
        "work": [
            5
        ]
    }
]
